const history = [
	{
		"version": "2.2",
		"date": "2025-06-27",
		"compatibility": "本体 v1.10.6 及以上版本",
		"changes": [
			"进一步优化界面性能，提升操作流畅度",
			"新增“伪禁”以及更多高级“伪禁”的禁将方式",
			"支持识别《AI优化》的禁将配置并导入到本扩展中",
			"新增“将池”功能，详细说明请查看扩展内帮助页",
			"新增音效调节滑动条，可自定义按钮音量大小",
			"修复了已知的bug，但保留了一部分。"
		]
	},
	{
		"version": "2.1",
		"date": "2024-10-10",
		"compatibility": "本体1.10.6及以上版本",
		"changes": [
			"新增方案按钮，支持切换禁将方案",
			"为界面缩放功能添加滑动条调节",
			"修复若干已知 Bug"
		]
	},
	{
		"version": "2.0",
		"date": "2024-09-09",
		"compatibility": "本体1.10.6及以上版本",
		"changes": [
			"重构代码结构，提高可维护性",
			"新增反选按钮，支持一键反选",
			"实现 DOM 逐帧渲染，提升性能",
			"添加按钮点击音效",
			"新增框选功能（仅电脑端可用）",
			"使用事件委托优化事件绑定机制",
			"支持一键开启“手杀将池”",
			"优化 UI 并新增多个快捷键"
		]
	}
]

const latestHistory = history[0];
export default latestHistory;
